package ch06;

public class Quiz03 {
    public static void main(String[] args) {
        /*
        필드, 생성자, 메소드에 대한 설명으로 틀린 것은 무엇입니까? 4
            ➊ 필드는 객체의 데이터를 저장한다.
                필드(속성, 멤버변수)
            ➋ 생성자는 객체의 초기화를 담당한다.
                ok 생성자는 객체를 초기화 하는 역할
                객체를 생성할때 실행됨
            ➌ 메소드는 객체의 동작 부분으로, 실행 코드를 가지고 있는 블록이다.
                메소드는 기능에 해당
                메소드 호출시 배개변수의 타입과 갯수가 일치해야함
            ➍ 클래스는 반드시 필드와 메소드를 가져야 한다.
            -> 클래스의 구성 멤버들은 생략되거나 복수로 작성될 수 있다.

             메소드영역 : 클래스에 대한 정보가 있으며,
             정적필드, 정적상수 ,메소드코드, 생성자코드가 저장

             힙영역 : 객체를 생성하면 객체(데이터를 가지고 있음)가 저장된다.

         */
    }
}
